#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.public_sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP requests"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS requests"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "travelapp-public-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "travelapp-public-sg"
        }
      + tags_all               = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "travelapp-public-sg"
        }
      + vpc_id                 = "vpc-07370bdafa53b8c4f"
    }

  # module.rds_public_sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all inbound traffic to RDS"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "travelapp-rds-public-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "travelapp-rds-public-sg"
        }
      + tags_all               = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "travelapp-rds-public-sg"
        }
      + vpc_id                 = "vpc-07370bdafa53b8c4f"
    }

  # module.vpc.aws_route_table.main will be updated in-place
  ~ resource "aws_route_table" "main" {
        id               = "rtb-0299c90bb8997687c"
      ~ tags             = {
          ~ "Name" = "false" -> "travelapp-routetable"
        }
      ~ tags_all         = {
          ~ "Name"        = "false" -> "travelapp-routetable"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public_subnets[0] will be updated in-place
  ~ resource "aws_subnet" "public_subnets" {
        id                                             = "subnet-01a9331b22ab97a18"
      ~ tags                                           = {
          ~ "Name" = "Public subnet 1" -> "travelapp-public-subnet-1"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "Public subnet 1" -> "travelapp-public-subnet-1"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public_subnets[1] will be updated in-place
  ~ resource "aws_subnet" "public_subnets" {
        id                                             = "subnet-0299bc63a7ad5223e"
      ~ tags                                           = {
          ~ "Name" = "Public subnet 2" -> "travelapp-public-subnet-2"
        }
      ~ tags_all                                       = {
          ~ "Name"        = "Public subnet 2" -> "travelapp-public-subnet-2"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + public_security_group_id = (known after apply)
  + rds_security_group_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*